Revit 2015 API
WorksetConfiguration Methods
The WorksetConfiguration type exposes the following members.
Methods
Name | Description
Close
 Sets a group of user-created worksets to close.
CloseAll |  Obsolete.
 Sets the configuration to close user-created worksets by default.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Open
 Sets a group of user-created worksets to open.
OpenLastViewed |  Obsolete.
 Sets the configuration to open all user-created worksets that were last recorded to be open; other worksets are not affected.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace